Documents/АудитМагазинов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АудитМагазинов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАудитаМагазинов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Результаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяАудита</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОпросникДляАудитаМагазинов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеФайла</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийАктПеревозчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийАктПеревозчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаВТорговуюТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаНаСклад</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктПеревозчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АктПеревозчика</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийАктПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаПеревозку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоездок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПеревозки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПриходныеОрдера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриходныйОрдер</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерСклад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТТН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходныеОрдера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасходныйОрдер</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйОрдерСклад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТТН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыТранспортныхКомпаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АудитМагазинов/Ext/ManagerModule.bsl
Функция ПечатьОтчетов(МассивСсылок) Экспорт
	ТекущийДокумент = 0;
	ТабличныйДокуемнт = Новый ТабличныйДокумент;
	Макет = Документы.АудитМагазинов.ПолучитьМакет("АудитМагазинов");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	АудитМагазиновРезультаты.Ссылка КАК ДокументСсылка,
	               |	АудитМагазиновРезультаты.НомерСтроки КАК НомерСтроки,
	               |	АудитМагазиновРезультаты.СтатьяАудита.Наименование КАК СтатьяАудита,
	               |	АудитМагазиновРезультаты.Результат,
	               |	АудитМагазиновРезультаты.Комментарии,
	               |	АудитМагазиновРезультаты.Ссылка.Статус КАК Статус,
	               |	АудитМагазиновРезультаты.Ссылка.Результат КАК ОбщийРезультат,
	               |	АудитМагазиновРезультаты.СтатьяАудита.Родитель КАК Группа,
	               |	АудитМагазиновРезультаты.Ссылка.Магазин.Адрес КАК АдресМагазина,
	               |	АудитМагазиновРезультаты.Ссылка.Проверяющий КАК Проверяющий,
	               |	АудитМагазиновРезультаты.Ссылка.Дата КАК Дата
	               |ИЗ
	               |	Документ.АудитМагазинов.Результаты КАК АудитМагазиновРезультаты
	               |ГДЕ
	               |	АудитМагазиновРезультаты.Ссылка В(&МассивСсылок)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АудитМагазиновРезультаты.Ссылка.Дата,
	               |	НомерСтроки
	               |ИТОГИ
	               |	МАКСИМУМ(Статус),
	               |	МАКСИМУМ(ОбщийРезультат),
	               |	МАКСИМУМ(АдресМагазина),
	               |	МАКСИМУМ(Проверяющий),
	               |	МАКСИМУМ(Дата)
	               |ПО
	               |	ДокументСсылка";
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументов.Следующий() Цикл
		ТекущийДокумент = ТекущийДокумент + 1;
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаДокументов);
		ОбластьШапка.Параметры.Дата = Формат(ВыборкаДокументов.Дата,"ДЛФ=DD");
		ТабличныйДокуемнт.Вывести(ОбластьШапка);
		Выборка = ВыборкаДокументов.Выбрать();
		нс=0;
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТЧ.Параметры,Выборка);
			ТабличныйДокуемнт.Вывести(ОбластьСтрокаТЧ);
		КонецЦикла;
		Если ТекущийДокумент < 	МассивСсылок.Количество() Тогда
			ТабличныйДокуемнт.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныйДокуемнт;
КонецФункции


Функция ПечатьТТН(Ссылка, СПодписью = Ложь) Экспорт 
	
	ТабДокумент	= Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПараметрыПечати_АктПеревозчика_ТТН";
	
	ЭтоОтгрузкаВТТ = (Ссылка.ВидОперации = Перечисления.ВидыОперацийАктПеревозчика.ОтгрузкаВТорговуюТочку);
	
	// 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если ЭтоОтгрузкаВТТ Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходныеОрдера.Водитель КАК Водитель,
		|	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Наименование КАК ГруппаТоваров
		|ИЗ
		|	Документ.АктПеревозчика.РасходныеОрдера КАК РасходныеОрдера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
		|		ПО (РасходныйОрдерСкладТовары.Ссылка = РасходныеОрдера.РасходныйОрдер)
		|ГДЕ
		|	РасходныеОрдера.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныеОрдера.Водитель,
		|	РасходныйОрдерСкладТовары.Номенклатура.Родитель.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(РасходныеОрдера.РасходныйОрдер.Дата, ДЕНЬ) КАК Дата,
		|	РасходныеОрдера.НомерТТН КАК НомерТТН,
		|	РасходныеОрдера.Водитель КАК Водитель,
		|	РасходныеОрдера.Автомобиль КАК Автомобиль,
		|	РасходныеОрдера.РасходныйОрдер КАК РасходныйОрдер
		|ИЗ
		|	Документ.АктПеревозчика.РасходныеОрдера КАК РасходныеОрдера
		|ГДЕ
		|	РасходныеОрдера.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасходныеОрдера.НомерТТН
		|ИТОГИ ПО
		|	Дата,
		|	НомерТТН,
		|	Водитель";
	Иначе //Если Ссылка.ВидОперации = Перечисления.ВидыОперацийАктПеревозчика.ДоставкаНаСклад Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходныеОрдера.Водитель КАК Водитель,
		|	ПриходныйОрдерСкладТовары.Номенклатура.Родитель.Наименование КАК ГруппаТоваров
		|ИЗ
		|	Документ.АктПеревозчика.ПриходныеОрдера КАК ПриходныеОрдера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерСклад.Товары КАК ПриходныйОрдерСкладТовары
		|		ПО (ПриходныйОрдерСкладТовары.Ссылка = ПриходныеОрдера.ПриходныйОрдер)
		|ГДЕ
		|	ПриходныеОрдера.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходныеОрдера.Водитель,
		|	ПриходныйОрдерСкладТовары.Номенклатура.Родитель.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ПриходныеОрдера.ПриходныйОрдер.ДатаВремяЗаездаМашины, ДЕНЬ) КАК Дата,
		|	ПриходныеОрдера.НомерТТН КАК НомерТТН,
		|	ПриходныеОрдера.Водитель КАК Водитель,
		|	ПриходныеОрдера.Автомобиль КАК Автомобиль,
		|	ПриходныеОрдера.ПриходныйОрдер КАК РасходныйОрдер,
		|	ПриходныеОрдера.ПриходныйОрдер.Поставщик КАК Поставщик
		|ИЗ
		|	Документ.АктПеревозчика.ПриходныеОрдера КАК ПриходныеОрдера
		|ГДЕ
		|	ПриходныеОрдера.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриходныеОрдера.НомерТТН
		|ИТОГИ ПО
		|	Дата,
		|	НомерТТН,
		|	Водитель";
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаГруппТоваров = РезультатыЗапроса[0].Выгрузить();
	
	//
	Макет = Документы.АктПеревозчика.ПолучитьМакет("ТТН");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	СтруктураОтбора = Новый Структура("Водитель");
	
	ЭтоЛугДаПоле 		= Ложь;
	ЭтоВкусВилл 		= Ложь;
	ПодписьДиректора 	= Неопределено;
	Если СПодписью Тогда
		ЭтоЛугДаПоле 	= (Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7726660031"));
		Если ЭтоЛугДаПоле Тогда
			ПодписьДиректора = Справочники.ФизическиеЛица.НайтиПоНаименованию("Кривенко Андрей Александрович").Подпись.Получить();
		КонецЕсли;
		ЭтоВкусВилл 	= (Ссылка.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7734675810"));
		Если ЭтоВкусВилл Тогда
			ПодписьДиректора = Справочники.ФизическиеЛица.НайтиПоНаименованию("Фарафонов Алексей Владимирович").Подпись.Получить();
		КонецЕсли;
	КонецЕсли;
	
	ВыборкаПоДатам = РезультатыЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Дата");
	Пока ВыборкаПоДатам.Следующий() Цикл
		
		мДатаТТН 		= ВыборкаПоДатам.Дата;
		
		Если ЭтоОтгрузкаВТТ Тогда
			СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Ссылка.Организация, мДатаТТН);
			мТекстГрузоотправителя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
														СведенияОбОрганизации, "НаименованиеСокращенное,ЮридическийАдрес,Телефоны");
		КонецЕсли;
		СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Ссылка.ОрганизацияПолучатель, мДатаТТН);
		мТекстГрузополучателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
																		СведенияОбОрганизации, "НаименованиеСокращенное,ЮридическийАдрес,Телефоны");
		
		ДатаНаПечать 	= Формат(мДатаТТН, "ДФ=""дд.ММ.гг""");
		ВыборкаПоНомерамТТН = ВыборкаПоДатам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерТТН");
		Пока ВыборкаПоНомерамТТН.Следующий() Цикл
			ТекНомерТТН = ВыборкаПоНомерамТТН.НомерТТН;
			ВыборкаПоВодителям = ВыборкаПоНомерамТТН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Водитель");
			Пока ВыборкаПоВодителям.Следующий() Цикл
				ТекВодитель = ВыборкаПоВодителям.Водитель;
				
				// Страница 1
				ОбластьМакета.Параметры.ДатаТТН 	= ДатаНаПечать;
				ОбластьМакета.Параметры.НомерТТН 	= Формат(ТекНомерТТН, "ЧГ=");
				
				Если НЕ ЭтоОтгрузкаВТТ Тогда
					СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ВыборкаПоВодителям.Поставщик, мДатаТТН);
					мТекстГрузоотправителя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
																		СведенияОбОрганизации, "НаименованиеСокращенное,ЮридическийАдрес,Телефоны");
				КонецЕсли;
				ОбластьМакета.Параметры.Грузополучатель 	= мТекстГрузополучателя;
				
				СтруктураОтбора.Водитель = ТекВодитель;
				СтрокиТаблицыГрупп = ТаблицаГруппТоваров.НайтиСтроки(СтруктураОтбора);
				СтрокаГрупп = "";
				Для Каждого СтрокаТаблицы Из СтрокиТаблицыГрупп Цикл
					СтрокаГрупп = СтрокаГрупп + "; " + СокрЛП(СтрокаТаблицы.ГруппаТоваров);
				КонецЦикла;
				Если НЕ СтрокаГрупп = "" Тогда
					СтрокаГрупп = Сред(СтрокаГрупп, 3);
				КонецЕсли;
				ОбластьМакета.Параметры.НаименованиеГруза = СтрокаГрупп;
				
				ТекстОрдеров 	= "";
				ТекАвтомобиль 	= "";
				ТекПоставщик 	= "";
				Выборка = ВыборкаПоВодителям.Выбрать();
				Пока Выборка.Следующий() Цикл
					ТекАвтомобиль 	= Выборка.Автомобиль; 	// предположение, что 1 водитель ездит на одной машине в течение дня
					Если НЕ ЭтоОтгрузкаВТТ Тогда
						ТекПоставщик = Выборка.Поставщик; 	// предположение, что 1 водитель ездит на одной машине к одному поставщику
					КонецЕсли;
					ТекстОрдеров = ТекстОрдеров + "; " + ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.РасходныйОрдер) + " от " + ДатаНаПечать;
				КонецЦикла;
				Если НЕ ТекстОрдеров = "" Тогда
					ТекстОрдеров = Сред(ТекстОрдеров, 3);
				КонецЕсли;
				ОбластьМакета.Параметры.ПереченьДокументов = ?(ЭтоОтгрузкаВТТ, "Расходные ордера: ", "Приходные ордера: ") + ТекстОрдеров + ".";
				
				Если НЕ ТекПоставщик = "" Тогда // доставка на склад: поставщик = Грузоотправитель
					СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ТекПоставщик, мДатаТТН);
					мТекстГрузоотправителя = ?(ЗначениеЗаполнено(СведенияОбОрганизации.НаименованиеДляПечатныхФорм),
												СведенияОбОрганизации.НаименованиеДляПечатныхФорм + ", ", "") +
											ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ЮридическийАдрес,Телефоны");
					//мТекстГрузоотправителя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
					//													СведенияОбОрганизации, "НаименованиеСокращенное,ЮридическийАдрес,Телефоны");
				КонецЕсли;
				ОбластьМакета.Параметры.Грузоотправитель	= мТекстГрузоотправителя;
				
				// Страница 2
				ИмяВодителя = СокрЛП(ТекВодитель.Наименование);
				ОбластьМакета.Параметры.Перевозчик 	= СокрЛП(Ссылка.Перевозчик.Наименование);
				ОбластьМакета.Параметры.Водитель 		= ИмяВодителя;
				ОбластьМакета.Параметры.Автомобиль 		= ТекАвтомобиль;
				ОбластьМакета.Параметры.ГосНомерАвтомобиля = СокрЛП(ТекАвтомобиль.Наименование);
				Если ЭтоОтгрузкаВТТ Тогда
					ОбластьМакета.Параметры.Руководитель = ОбщегоНазначения.ФамилияИнициалыФизЛица(СокрЛП(Ссылка.Организация.ГенеральныйДиректор));
				КонецЕсли;
				ОбластьМакета.Параметры.ФИОВодителя 	= ОбщегоНазначения.ФамилияИнициалыФизЛица(ИмяВодителя);
				ОбластьМакета.Параметры.ДатаТТН 		= ДатаНаПечать;
				
				Если СПодписью
						И (ЭтоЛугДаПоле
							ИЛИ ЭтоВкусВилл)
						И ТипЗнч(ПодписьДиректора) = Тип("Картинка") Тогда
					РисунокПодписи = ОбластьМакета.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			    	РисунокПодписи.Расположить(ОбластьМакета.Область(105, 11, 107, 12));
					РисунокПодписи.Узор 		= ТипУзораТабличногоДокумента.БезУзора;
			    	РисунокПодписи.ЦветФона 	= Новый Цвет; // автоцвет (прозрачный чтоб полоску подчеркивания видно было)
			    	РисунокПодписи.Линия 		= Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии, 0);
			    	РисунокПодписи.Картинка 	= ПодписьДиректора;
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабДокумент.ПолеСнизу 			= 5;
	ТабДокумент.ПолеСверху 			= 5;	
	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ОтображатьСетку 	= Ложь;
	ТабДокумент.Защита 				= Ложь;
	ТабДокумент.ТолькоПросмотр 		= Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабДокумент;
	
КонецФункции
